app/controllers/api/v1/games_controller.rb

INSERT INTO "games" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Joe"], ["created_at", "2018-01-22 18:21:02.130432"], ["updated_at", "2018-01-22 18:21:02.130432"]]
---
  def create
    @game = Game.create(game_params)

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 79], ["LIMIT", 1]]
UPDATE "games" SET "score" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["score", 5000], ["updated_at", "2018-01-23 20:29:27.827223"], ["id", 80]]
---
  def update
    @game = Game.find(params[:id])
    @game.score = @game.compute_score
    @game.save