app/controllers/api/v1/responses_controller.rb

INSERT INTO "responses" ("game_id", "question_id", "is_correct", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["game_id", 64], ["question_id", 1], ["is_correct", "t"], ["created_at", "2018-01-23 18:08:36.825496"], ["updated_at", "2018-01-23 18:08:36.825496"]]
---
  def create
    @response = Response.create(response_params)